In [1]:
import numpy as np
import pandas as pd

In [19]:
key = pd.array('K0 K1 K2 K3'.split())
key_2  = pd.array('K0 K1 K3 K4'.split())
a = pd.array('A0 A1 A2 A3'.split())
b = pd.array('B0 B1 B2 B3'.split())
c = pd.array('C0 C1 C2 C3'.split())
d = pd.array('D0 D1 D2 D3'.split())

left_array = list(zip(key,a,b))
right_array = list(zip(key_2,c,d))

In [20]:
left = pd.DataFrame(
    data = left_array,
    index = '0 1 2 3'.split(),
    columns = 'key A B'.split()
)
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [21]:
right = pd.DataFrame(
    data = right_array,
    index = '0 1 2 3'.split(),
    columns = 'key C D'.split()
)
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K3  C2  D2
3  K4  C3  D3

In [22]:
pd.merge(left,right,on = 'key') # inner join

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K3  A3  B3  C2  D2

In [23]:
pd.merge(left,right,how ='outer',on = 'key') #  full outer join

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3   C2   D2
4  K4  NaN  NaN   C3   D3

In [24]:
pd.merge(left,right,how = 'right',on = 'key') # right outer join

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K3   A3   B3  C2  D2
3  K4  NaN  NaN  C3  D3

In [25]:
pd.merge(left,right,how = 'left', on = 'key') # left outer join

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2  NaN  NaN
3  K3  A3  B3   C2   D2

In [30]:
new_left = pd.DataFrame(
    data = list(zip(a,b)),
    index = key,
    columns = 'A B'.split()
)
new_right = pd.DataFrame(
    data = list(zip(c,d)),
    index = key_2,
    columns = 'C D'.split()
)

In [31]:
new_left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [32]:
new_right

     C   D
K0  C0  D0
K1  C1  D1
K3  C2  D2
K4  C3  D3

In [34]:
new_left.join(new_right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1   C1   D1
K2  A2  B2  NaN  NaN
K3  A3  B3   C2   D2

In [37]:
new_left.join(new_right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1   C1   D1
K2   A2   B2  NaN  NaN
K3   A3   B3   C2   D2
K4  NaN  NaN   C3   D3

In [39]:
df1 = pd.DataFrame(
    data = list(zip(a,b,c,d)),
    index = '0 1 2 3'.split(),
    columns = 'A B C D'.split()
)
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [41]:
a_2 = 'A4 A5 A6 A7'.split()
b_2 = 'B4 B5 B6 B7'.split()
c_2 = 'C4 C5 C6 C7'.split()
d_2 = 'D4 D5 D6 D7'.split()
df2_array = list(zip(a_2,b_2,c_2,d_2))
df2 = pd.DataFrame(
    data = df2_array,
    index = '4 5 6 7'.split(),
    columns = 'A B C D'.split()
)
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [42]:
a_3 = 'A8 A9 A10 A11'.split()
b_3 = 'B8 B9 B10 B11'.split()
c_3 = 'C8 C9 C10 C11'.split()
d_3 = 'D8 D9 D10 D11'.split()
df3_array = list(zip(a_3,b_3,c_3,d_3))
df3 = pd.DataFrame(
    data = df2_array,
    index = '8 9 10 11'.split(),
    columns = 'A B C D'.split()
)
df3

     A   B   C   D
8   A4  B4  C4  D4
9   A5  B5  C5  D5
10  A6  B6  C6  D6
11  A7  B7  C7  D7

In [45]:
pd.concat([df1,df2,df3])

     A   B   C   D
0   A0  B0  C0  D0
1   A1  B1  C1  D1
2   A2  B2  C2  D2
3   A3  B3  C3  D3
4   A4  B4  C4  D4
5   A5  B5  C5  D5
6   A6  B6  C6  D6
7   A7  B7  C7  D7
8   A4  B4  C4  D4
9   A5  B5  C5  D5
10  A6  B6  C6  D6
11  A7  B7  C7  D7

In [56]:
pd.concat([df1,df2,df3]).transpose()

    0   1   2   3   4   5   6   7   8   9  10  11
A  A0  A1  A2  A3  A4  A5  A6  A7  A4  A5  A6  A7
B  B0  B1  B2  B3  B4  B5  B6  B7  B4  B5  B6  B7
C  C0  C1  C2  C3  C4  C5  C6  C7  C4  C5  C6  C7
D  D0  D1  D2  D3  D4  D5  D6  D7  D4  D5  D6  D7

In [54]:
pd.concat([df1,df2,df3],axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A4   B4   C4   D4
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A5   B5   C5   D5
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A6   B6   C6   D6
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [59]:
df = pd.DataFrame(
    {'col1' : [1,2,3,4],
    'col2' : [444,555,666,444],
    'col3' : ['abc','def','ghi','xyz']
    }
)
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [60]:
def divide(x):
    return x/2
df['col2'].apply(divide)

0    222.0
1    277.5
2    333.0
3    222.0
Name: col2, dtype: float64

In [61]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [63]:
len(df['col3'])

4

In [65]:
df['col1'].apply(lambda x: x*3)

0     3
1     6
2     9
3    12
Name: col1, dtype: int64

In [67]:
import math as m
df['col2'].apply(lambda x : m.log2(x))

0    8.794416
1    9.116344
2    9.379378
3    8.794416
Name: col2, dtype: float64

In [69]:
df['col4'] = df['col1'] + df['col2']
df

   col1  col2 col3  col4
0     1   444  abc   445
1     2   555  def   557
2     3   666  ghi   669
3     4   444  xyz   448

In [98]:
a_p = pd.array('foo foo foo bar bar bar'.split())
b_p = pd.array('one one two two one one'.split())
c_p = pd.array('x y x y x y'.split())
d_p = pd.array('1 3 2 5 4 1'.split())
data = list(zip(a_p,b_p,c_p,d_p))
df_pivot = pd.DataFrame(
    data = data,
    index = '0 1 2 3 4 5'.split(),
    columns = 'A B C D'.split()
)
df_pivot

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [110]:
data_2 = { 'A' : ['foo','foo','foo','bar','bar','bar'],'B':['one','one','two','two','one','one'],'C':['x','y','x','y','x','y'],'D':[1,3,2,5,4,1]}
dfp = pd.DataFrame(data_2)
dfp

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [124]:
dfp.pivot_table(values='D',index = ['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [121]:
pd.read_csv(r'/Users/owen/Desktop/example.csv')

,No Kuesioner,Nama Kuesioner,Nama Surveyor,No. Surveyor,Waktu Submit,Responden Asli / Pengganti,Kunjungan 1,Kunjungan 2,Kunjungan 3,Kunjungan 4,...,DAPIL,Provinsi,P1,P2,P3,P4,P6,P7,PARPOL,PresidenNew
0,9,Kuesioner 9,Surveyor 1 Aceh Besar - Lambaro,302306658,05/04/2019,Asli,NaN,NaN,NaN,NaN,...,ACEH I,Aceh,4,4,5,1,18,1,5,3
1,123,Kuesioner 123,Surveyor 13 Kota Tangerang Selatan - Paku Jaya,104818320,02/04/2019,Pengganti,31 Mar 2019 15:49 Tidak ada di rumah,NaN,NaN,NaN,...,BANTEN III,Banten,1,16,2,1,6,3,22,3
2,124,Kuesioner 124,Surveyor 13 Kota Tangerang Selatan - Paku Jaya,104818320,02/04/2019,Pengganti,31 Mar 2019 16:38 Sudah pindah,NaN,NaN,NaN,...,BANTEN III,Banten,4,3,1,1,6,3,22,3
3,143,Kuesioner 143,Surveyor 15 Tangerang - Jatake,828954014,02/04/2019,Pengganti,30 Mar 2019 05:55 karena yang bersangkutan tid...,NaN,NaN,NaN,...,BANTEN III,Banten,2,17,8,1,4,5,22,3
4,144,Kuesioner 144,Surveyor 15 Tangerang - Jatake,828954014,02/04/2019,Asli,NaN,NaN,NaN,NaN,...,BANTEN III,Banten,3,3,8,1,4,7,22,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
134,1988,Kuesioner 1988,Surveyor 199 Batu Bara - Pulausejuk,665567563,31/03/2019,Asli,NaN,NaN,NaN,NaN,...,SUMATERA UTARA III,Sumatera Utara,1,12,8,3,5,4,22,3
135,1994,Kuesioner 1994,Surveyor 200 Langkat - Naman Jahe,405678149,29/03/2019,Asli,NaN,NaN,NaN,NaN,...,SUMATERA UTARA III,Sumatera Utara,2,3,8,1,10,6,22,3
136,1997,Kuesioner 1997,Surveyor 200 Langkat - Naman Jahe,405678149,30/03/2019,Asli,NaN,NaN,NaN,NaN,...,SUMATERA UTARA III,Sumatera Utara,4,14,8,1,18,1,22,3
137,1999,Kuesioner 1999,Surveyor 200 Langkat - Naman Jahe,405678149,30/03/2019,Pengganti,30 Mar 2019 13:03 SUDAH MENINGGAL,NaN,NaN,NaN,...,SUMATERA UTARA III,Sumatera Utara,2,12,3,1,10,5,22,3
138,2000,Kuesioner 2000,Surveyor 200 Langkat - Naman Jahe,405678149,30/03/2019,Pengganti,30 Mar 2019 12:40 TIDAK ADA DIRUMAH,NaN,NaN,NaN,...,SUMATERA UTARA III,Sumatera Utara,4,15,4,1,10,4,22,3

In [123]:
pd.read_excel(r'/Users/owen/Desktop/contoh excel.xlsx')

,No Kuesioner,Nama Kuesioner,Nama Surveyor,No. Surveyor,Waktu Submit,Responden Asli / Pengganti,Kunjungan 1,Kunjungan 2,Kunjungan 3,Kunjungan 4,...,DAPIL,Provinsi,P1,P2,P3,P4,P6,P7,PARPOL,PresidenNew
0,9,Kuesioner 9,Surveyor 1 Aceh Besar - Lambaro,302306658,05/04/2019,Asli,NaN,NaN,NaN,NaN,...,ACEH I,Aceh,4,4,5,1,18,1,5,3
1,123,Kuesioner 123,Surveyor 13 Kota Tangerang Selatan - Paku Jaya,104818320,02/04/2019,Pengganti,31 Mar 2019 15:49 Tidak ada di rumah,NaN,NaN,NaN,...,BANTEN III,Banten,1,16,2,1,6,3,22,3
2,124,Kuesioner 124,Surveyor 13 Kota Tangerang Selatan - Paku Jaya,104818320,02/04/2019,Pengganti,31 Mar 2019 16:38 Sudah pindah,NaN,NaN,NaN,...,BANTEN III,Banten,4,3,1,1,6,3,22,3
3,143,Kuesioner 143,Surveyor 15 Tangerang - Jatake,828954014,02/04/2019,Pengganti,30 Mar 2019 05:55 karena yang bersangkutan tid...,NaN,NaN,NaN,...,BANTEN III,Banten,2,17,8,1,4,5,22,3
4,144,Kuesioner 144,Surveyor 15 Tangerang - Jatake,828954014,02/04/2019,Asli,NaN,NaN,NaN,NaN,...,BANTEN III,Banten,3,3,8,1,4,7,22,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
134,1988,Kuesioner 1988,Surveyor 199 Batu Bara - Pulausejuk,665567563,31/03/2019,Asli,NaN,NaN,NaN,NaN,...,SUMATERA UTARA III,Sumatera Utara,1,12,8,3,5,4,22,3
135,1994,Kuesioner 1994,Surveyor 200 Langkat - Naman Jahe,405678149,29/03/2019,Asli,NaN,NaN,NaN,NaN,...,SUMATERA UTARA III,Sumatera Utara,2,3,8,1,10,6,22,3
136,1997,Kuesioner 1997,Surveyor 200 Langkat - Naman Jahe,405678149,30/03/2019,Asli,NaN,NaN,NaN,NaN,...,SUMATERA UTARA III,Sumatera Utara,4,14,8,1,18,1,22,3
137,1999,Kuesioner 1999,Surveyor 200 Langkat - Naman Jahe,405678149,30/03/2019,Pengganti,30 Mar 2019 13:03 SUDAH MENINGGAL,NaN,NaN,NaN,...,SUMATERA UTARA III,Sumatera Utara,2,12,3,1,10,5,22,3
138,2000,Kuesioner 2000,Surveyor 200 Langkat - Naman Jahe,405678149,30/03/2019,Pengganti,30 Mar 2019 12:40 TIDAK ADA DIRUMAH,NaN,NaN,NaN,...,SUMATERA UTARA III,Sumatera Utara,4,15,4,1,10,4,22,3